import homepageImg from "../images/homepageImg.png";

export default function creatHomePage() {
    const homeDiv = document.createElement('div');
    homeDiv.classList.add('home-container')
    homeDiv.innerHTML = `
        <h1>Welcome to my Eastern Magic Restaurant!</h1>
        <p>我们提供超追无敌新鲜美味的北海道辣白菜包金枪鱼生鱼片锅贴</p>
        <p>在城市肌理的褶皱里，藏着一处被时间轻吻的味觉秘境 ——Eastern Magic Restaurant。这里没有喧嚣的招牌，只有光影编织的帘幕，将市井的浮躁轻轻隔绝在外，让每一位推门而入的食客，都能坠入一场跨越维度的味蕾幻梦。</p>
        <p>店内的灵魂之作，当属那道北海道辣白菜包金枪鱼生鱼片锅贴。它像一封来自北境与深海的联名信，将北海道雪原上酝酿的辛辣诗意，与深海金枪鱼的绵密温柔，封存在一枚金黄酥脆的锅贴里。北海道辣白菜的发酵酸香带着冰原的清冽，在高温煎制中蒸腾出让人迷醉的气息，包裹着的金枪鱼生鱼片褪去了生食的凛冽，在面皮的怀抱里化作一抹柔滑的鲜甜，仿佛将鄂霍次克海的浪花与札幌街头的烟火，一同锁进了焦香的边缘。</p>
        <p>锅贴入口的瞬间，是多重感官的错位与交融。脆壳裂开的声响像极了北海道初春的冰裂，辣白菜的辛辣不是直白的冲击，而是带着发酵后的温润回甘，金枪鱼的鲜甜则如深海暗流般缓缓涌动，与面皮的麦香缠绕交织。这不是简单的食材堆砌，而是一场味觉的抽象派画作 —— 辛辣是画布上跳跃的红，鲜甜是流淌的蓝，酥脆是笔触的肌理，每一口都在解构着传统与创新的边界，让味蕾在熟悉与陌生之间，完成一场奇妙的迁徙。</p>
        <p>在这里，食物不再是果腹的载体，而是一场流动的感官仪式。Eastern Magic Restaurant 用这枚锅贴，将北海道的风、深海的潮与东方的烟火气，酿成了一杯让人微醺的味觉酒，等待每一个懂它的人，来解锁藏在褶皱里的味觉魔法。</p>
    `;
    return homeDiv;
}